skydivervrn/flysight-2-firmware/STM32_WPAN/App/app_ble.c
  /* USER CODE BEGIN APP_BLE_Init_3 */
  /* Create timer to handle the connection state machine */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &Advertising_mgr_timer_Id, hw_ts_SingleShot, Adv_Update_Req);
#if 0
  /* USER CODE END APP_BLE_Init_3 */

  /**
   * Make device discoverable
   */
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = NULL;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 0;

  /**
   * Start to Advertise to be connected by a Client
   */
  Adv_Request(APP_BLE_FAST_ADV);

  /* USER CODE BEGIN APP_BLE_Init_2 */
#endif
  /**
   * Make device discoverable
   */
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = NULL;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 0;

  /**
   * Start to Advertise to be connected by a Client
   */
  FS_Adv_Request(APP_BLE_FAST_ADV);
  /* USER CODE END APP_BLE_Init_2 */

  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *p_Pckt)
{
  hci_event_pckt    *p_event_pckt;
  evt_le_meta_event *p_meta_evt;
  evt_blecore_aci   *p_blecore_evt;
  tBleStatus        ret = BLE_STATUS_INVALID_PARAMS;
  hci_le_enhanced_connection_complete_event_rp0 *p_enhanced_connection_complete_event;
  hci_disconnection_complete_event_rp0        *p_disconnection_complete_event;
#if (CFG_DEBUG_APP_TRACE != 0)
  hci_le_connection_update_complete_event_rp0 *p_connection_update_complete_event;
#endif /* CFG_DEBUG_APP_TRACE != 0 */
  aci_l2cap_connection_update_req_event_rp0 *pr;
  hci_le_advertising_report_event_rp0 * le_advertising_event;
  uint8_t result;
  uint8_t role, event_type, event_data_size;
  int k = 0;
  uint8_t *adv_report_data;
  uint8_t adtype, adlength;
  uint16_t connection_handle;

  /* PAIRING */
  aci_gap_pairing_complete_event_rp0          *p_pairing_complete;
  /* PAIRING */

  /* USER CODE BEGIN SVCCTL_App_Notification */

  /* USER CODE END SVCCTL_App_Notification */

  p_event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) p_Pckt)->data;

  switch (p_event_pckt->evt)
  {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
      p_disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) p_event_pckt->data;

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

      /* USER CODE END EVT_DISCONN_COMPLETE */

      /* Record 4, the second half. Reasons worth knowing by heart: 0x08
       * supervision timeout (walked out of range / powered off), 0x13 remote
       * user terminated, 0x16 local host terminated, 0x3D MIC failure and 0x05
       * authentication failure — the last two are what a broken bond looks like
       * from the link layer, as against a peer that was simply never let in. */
      FS_BleDiag_Log("DISC handle=0x%04X reason=0x%02X peer=%s status=0x%02X",
          (unsigned) p_disconnection_complete_event->Connection_Handle,
          (unsigned) p_disconnection_complete_event->Reason,
          (p_disconnection_complete_event->Connection_Handle
              == BleApplicationContext.connectionHandleEndDevice1) ? "engo" :
          (p_disconnection_complete_event->Connection_Handle
              == BleApplicationContext.connectionHandleCentral) ? "phone" : "other",
          (unsigned) p_disconnection_complete_event->Status);

      if (p_disconnection_complete_event->Connection_Handle == BleApplicationContext.connectionHandleEndDevice1)
      {
        APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT OF END DEVICE 1 \n\r");
        BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_IDLE;
        BleApplicationContext.connectionHandleEndDevice1 = 0xFFFF;

        /* Reason per BT spec: 0x08 supervision timeout (out of range/powered
         * off), 0x13 remote terminated, 0x16 local terminated (self-heal). */
        FS_Log_WriteEventAsync("ENGO disconnected: reason 0x%02X",
                               p_disconnection_complete_event->Reason);

        /* Reset GATT client and app FSM, then restart discovery */
        FS_ActiveLook_Client_OnDisconnect();
        FS_ActiveLook_OnDisconnect();
        UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
      }

      if (p_disconnection_complete_event->Connection_Handle == BleApplicationContext.connectionHandleCentral)
      {
        APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT OF SMART PHONE \n\r");
        BleApplicationContext.SmartPhone_Connection_Status = APP_BLE_IDLE;
        BleApplicationContext.connectionHandleCentral = 0xFFFF;

        /* Poisoned-bond self-heal. A link that ends without a successful
         * PAIRING_COMPLETE counts against its identity when it looks like a
         * broken bond: an explicit security failure (0x05 authentication,
         * 0x06 PIN/key missing, 0x3D MIC), or any death within 3 s of the
         * connect — a stale-key central connects, fails encryption and drops
         * in well under a second, while a human browsing and leaving takes
         * longer. Two in a row from the same identity and that bond is
         * removed, so the peer's next pairing attempt starts clean. */
        if (central_id_valid && !central_pair_ok)
        {
          uint8_t reason = p_disconnection_complete_event->Reason;
          uint8_t security_reason = (reason == 0x05) || (reason == 0x06)
                                 || (reason == 0x3D);
          uint8_t died_fast = (HAL_GetTick() - central_conn_tick) < 3000;

          if (security_reason || died_fast)
          {
            if (central_fail_count > 0
                && central_fail_type == central_id_type
                && memcmp(central_fail_addr, central_id_addr, 6) == 0)
            {
              central_fail_count++;
            }
            else
            {
              central_fail_count = 1;
              central_fail_type = central_id_type;
              memcpy(central_fail_addr, central_id_addr, 6);
            }

            if (central_fail_count >= 2)
            {
              tBleStatus evict_ret = aci_gap_remove_bonded_device(
                  central_fail_type, central_fail_addr);
              central_fail_count = 0;
#if FS_BLE_DIAG
              {
                char evictStr[18];
                FS_BleDiag_FormatAddr(evictStr, sizeof(evictStr),
                                      central_fail_addr);
                FS_BleDiag_Log("BOND_EVICT type=%u addr=%s remove=0x%02X"
                               " reason=0x%02X",
                    (unsigned) central_fail_type, evictStr,
                    (unsigned) evict_ret, (unsigned) reason);
              }
#endif
            }
          }
        }
        else
        {
          central_fail_count = 0;
        }
        central_id_valid = 0;
        central_pair_ok = 0;

        if (FS_State_Get()->enable_ble)
        {
          /* restart advertising */
          FS_Adv_Request(APP_BLE_FAST_ADV);
        }

        HandleNotification.Custom_Evt_Opcode = CUSTOM_DISCON_HANDLE_EVT;
        HandleNotification.ConnectionHandle = 0xFFFF;
        Custom_APP_Notification(&HandleNotification);
      }
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

    case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (evt_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
#if (CFG_DEBUG_APP_TRACE != 0)
          p_connection_update_complete_event = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          APP_DBG_MSG(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          APP_DBG_MSG("     - Connection Interval:   %.2f ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n\r",
                       p_connection_update_complete_event->Conn_Interval*1.25,
                       p_connection_update_complete_event->Conn_Latency,
                       p_connection_update_complete_event->Supervision_Timeout*10);
#endif /* CFG_DEBUG_APP_TRACE != 0 */

